In [1]:
import csv
import json
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

In [2]:
rt_reviews_df = pd.read_csv('../Data/rt.reviews.tsv',
                           delimiter='\t',
                           encoding=('unicode_escape'))

In [3]:
rt_reviews_df.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [4]:
rt_reviews_df['rating'].value_counts()

3/5       4327
4/5       3672
3/4       3577
2/5       3160
2/4       2712
          ...
4.9          1
1.7          1
4.2/5        1
7.3/10       1
3/2          1
Name: rating, Length: 186, dtype: int64

In [5]:
conn = sqlite3.connect('../Data/im.db')

In [6]:
pd.read_sql('''
SELECT
    *
FROM
    sqlite_master

''',conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [13]:
tnmovie = pd.read_csv('../Data/tn.movie_budgets.csv')

In [14]:
tnmovie.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [15]:
tnmovie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [25]:
tnmovie['domestic_gross'] = tnmovie['domestic_gross'].str.replace('$','')

tnmovie['production_budget'] = tnmovie['production_budget'].str.replace('$','')

tnmovie['domestic_gross'] = tnmovie['domestic_gross'].str.replace(',','')

tnmovie['production_budget'] = tnmovie['production_budget'].str.replace(',','')

In [31]:
tnmovie['worldwide_gross'] = tnmovie['worldwide_gross'].str.replace('$','')

tnmovie['worldwide_gross'] = tnmovie['worldwide_gross'].str.replace(',','')

tnmovie['worldwide_gross'] = tnmovie['worldwide_gross'].astype(int)

In [26]:
tnmovie['domestic_gross'] = tnmovie['domestic_gross'].astype(int)

tnmovie['production_budget'] = tnmovie['production_budget'].astype(int)

In [27]:
tnmovie.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,"$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,"$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,"$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,"$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,"$1,316,721,747"

In [32]:
tnmovie['profit'] = tnmovie['worldwide_gross'] - tnmovie['production_budget']

In [33]:
tnmovie.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,profit
0,1,"Dec 18, 2009",Avatar,425000000,2776345279,2776345279,2351345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,1045663875,1045663875,635063875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,149762350,149762350,-200237650
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,1403013963,1403013963,1072413963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,1316721747,1316721747,999721747

In [38]:
tnmovie = tnmovie.sort_values(by='profit',
                   ascending=False)

In [70]:
tnmovie.shape

(5782, 7)

In [39]:
top500 = tnmovie.iloc[0:501]

In [40]:
top500

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,profit
0,1,"Dec 18, 2009",Avatar,425000000,2776345279,2776345279,2351345279
42,43,"Dec 19, 1997",Titanic,200000000,2208208395,2208208395,2008208395
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,2048134200,2048134200,1748134200
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,2053311220,2053311220,1747311220
33,34,"Jun 12, 2015",Jurassic World,215000000,1648854864,1648854864,1433854864
...,...,...,...,...,...,...,...
1369,70,"Nov 8, 2002",8 Mile,41000000,245768384,245768384,204768384
848,49,"Jun 5, 1998",The Truman Show,60000000,264118201,264118201,204118201
1398,99,"May 24, 1990",Back to the Future Part III,40000000,244088654,244088654,204088654
1004,5,"Jan 16, 2015",Paddington,55000000,258789097,258789097,203789097
1277,78,"Nov 7, 2003",Love Actually,45000000,248505300,248505300,203505300

In [64]:
moviebasics = pd.read_sql('''
SELECT
    primary_title,
    genres
FROM
    movie_basics
WHERE
    primary_title = original_title

''',conn)

In [65]:
moviebasics.head()

                primary_title              genres
0                   Sunghursh  Action,Crime,Drama
1  The Other Side of the Wind               Drama
2             Sabse Bada Sukh        Comedy,Drama
3                 A Thin Life              Comedy
4                     Bigfoot     Horror,Thriller

In [91]:
moviebasics.loc[moviebasics['primary_title'] == 'Titanic']

       primary_title     genres
36659        Titanic  Adventure
123871       Titanic     Family

In [59]:

moviebasics.join(top500,
                 on=moviebasics['primary_title'], top500['movie'],
                 how='inner')

SyntaxError: positional argument follows keyword argument (<ipython-input-59-3907af2fdef5>, line 2)

In [71]:
grouped = pd.merge(moviebasics,
                  tnmovie,
                  left_on='primary_title',
                  right_on='movie')

In [77]:
grouped.head()

,primary_title,genres,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,profit
0,Foodfight!,"Action,Animation,Comedy",26,"Dec 31, 2012",Foodfight!,45000000,73706,73706,-44926294
1,Mortal Kombat,"Action,Adventure,Fantasy",10,"Aug 18, 1995",Mortal Kombat,20000000,122133227,122133227,102133227
2,The Overnight,None,21,"Jun 19, 2015",The Overnight,200000,1165996,1165996,965996
3,The Overnight,"Comedy,Mystery",21,"Jun 19, 2015",The Overnight,200000,1165996,1165996,965996
4,On the Road,"Adventure,Drama,Romance",17,"Mar 22, 2013",On the Road,25000000,9313302,9313302,-15686698

In [79]:
grouped.sort_values(by='genres',
                   ascending=False,
                   inplace=True)

In [85]:
grouped.drop_duplicates(subset='primary_title',
                       inplace=True)

In [86]:
grouped.sort_values(by='profit',
                   ascending=False,
                   inplace=True)

In [90]:
top500.head(15)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,profit
0,1,"Dec 18, 2009",Avatar,425000000,2776345279,2776345279,2351345279
42,43,"Dec 19, 1997",Titanic,200000000,2208208395,2208208395,2008208395
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,2048134200,2048134200,1748134200
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,2053311220,2053311220,1747311220
33,34,"Jun 12, 2015",Jurassic World,215000000,1648854864,1648854864,1433854864
66,67,"Apr 3, 2015",Furious 7,190000000,1518722794,1518722794,1328722794
26,27,"May 4, 2012",The Avengers,225000000,1517935897,1517935897,1292935897
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,125000000,1341693157,1341693157,1216693157
41,42,"Feb 16, 2018",Black Panther,200000000,1348258224,1348258224,1148258224
112,13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,170000000,1305772799,1305772799,1135772799
155,56,"Nov 22, 2013",Frozen,150000000,1272469910,1272469910,1122469910
134,35,"Mar 17, 2017",Beauty and the Beast,160000000,1259199706,1259199706,1099199706
672,73,"Jul 10, 2015",Minions,74000000,1160336173,1160336173,1086336173
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,1403013963,1403013963,1072413963
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,94000000,1141403341,1141403341,1047403341

In [89]:
grouped.head(15)

,primary_title,genres,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,profit
2449,Titanic,Family,43,"Dec 19, 1997",Titanic,200000000,2208208395,2208208395,2008208395
2997,Avengers: Infinity War,"Action,Adventure,Sci-Fi",7,"Apr 27, 2018",Avengers: Infinity War,300000000,2048134200,2048134200,1748134200
12,Jurassic World,"Action,Adventure,Sci-Fi",34,"Jun 12, 2015",Jurassic World,215000000,1648854864,1648854864,1433854864
131,The Avengers,"Action,Adventure,Sci-Fi",27,"May 4, 2012",The Avengers,225000000,1517935897,1517935897,1292935897
1628,Black Panther,"Action,Adventure,Sci-Fi",42,"Feb 16, 2018",Black Panther,200000000,1348258224,1348258224,1148258224
3133,Jurassic World: Fallen Kingdom,"Action,Adventure,Sci-Fi",13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,170000000,1305772799,1305772799,1135772799
757,Frozen,"Adventure,Animation,Comedy",56,"Nov 22, 2013",Frozen,150000000,1272469910,1272469910,1122469910
2576,Beauty and the Beast,"Family,Fantasy,Musical",35,"Mar 17, 2017",Beauty and the Beast,160000000,1259199706,1259199706,1099199706
2290,Minions,"Adventure,Animation,Comedy",73,"Jul 10, 2015",Minions,74000000,1160336173,1160336173,1086336173
2392,Avengers: Age of Ultron,"Action,Adventure,Sci-Fi",4,"May 1, 2015",Avengers: Age of Ultron,330600000,1403013963,1403013963,1072413963
2868,Incredibles 2,"Action,Adventure,Animation",44,"Jun 15, 2018",Incredibles 2,200000000,1242520711,1242520711,1042520711
997,Aquaman,"Action,Adventure,Fantasy",36,"Dec 21, 2018",Aquaman,160000000,1146894640,1146894640,986894640
3079,The Fate of the Furious,"Action,Crime,Thriller",23,"Apr 14, 2017",The Fate of the Furious,250000000,1234846267,1234846267,984846267
2816,Despicable Me 3,"Adventure,Animation,Comedy",30,"Jun 30, 2017",Despicable Me 3,75000000,1034727750,1034727750,959727750
2996,Captain Marvel,"Action,Adventure,Sci-Fi",96,"Mar 8, 2019",Captain Marvel,175000000,1123061550,1123061550,948061550

In [96]:
top25genres = grouped.iloc[:501].value_counts('genres').head(25)

In [ ]:
top25genres